testrecords/delete/REQ_128157763.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header/><soap:Body><ucp:updateRequest xmlns:srw="http://www.loc.gov/zing/srw/" xmlns:ucp="http://www.loc.gov/zing/srw/update/"><srw:version>1.0</srw:version><ucp:action>info:srw/action/1/delete</ucp:action><ucp:recordIdentifier>128157763</ucp:recordIdentifier><srw:record><srw:recordPacking>xml</srw:recordPacking><srw:recordSchema>info:srw/schema/1/marcxml-v1.1</srw:recordSchema><srw:recordData><mx:record xmlns:mx="http://www.loc.gov/MARC21/slim"><mx:leader>     dam a22     5u 4500</mx:leader><mx:controlfield tag="001">128157763</mx:controlfield><mx:controlfield tag="003">ETHICS</mx:controlfield><mx:controlfield tag="005">20140122083027.0</mx:controlfield><mx:controlfield tag="008">990810nuuuuuuuu              00       |d</mx:controlfield><mx:datafield ind1=" " ind2=" " tag="040"><mx:subfield code="a">*******</mx:subfield><mx:subfield code="b">***</mx:subfield><mx:subfield code="c">ETH-BIB</mx:subfield><mx:subfield code="e">ETHICS-ISBD</mx:subfield></mx:datafield><mx:datafield ind1="0" ind2="0" tag="245"><mx:subfield code="a">@</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="898"><mx:subfield code="a">BK040000000</mx:subfield></mx:datafield></mx:record></srw:recordData></srw:record></ucp:updateRequest></soap:Body></soap:Envelope>