testrecords/update/REQ_094491089.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header/><soap:Body><ucp:updateRequest xmlns:srw="http://www.loc.gov/zing/srw/" xmlns:ucp="http://www.loc.gov/zing/srw/update/"><srw:version>1.0</srw:version><ucp:action>info:srw/action/1/replace</ucp:action><ucp:recordIdentifier>094491089</ucp:recordIdentifier><srw:record><srw:recordPacking>xml</srw:recordPacking><srw:recordSchema>info:srw/schema/1/marcxml-v1.1</srw:recordSchema><srw:recordData><mx:record xmlns:mx="http://www.loc.gov/MARC21/slim"><mx:leader>     cam a22     1i 4500</mx:leader><mx:controlfield tag="001">094491089</mx:controlfield><mx:controlfield tag="003">Sz</mx:controlfield><mx:controlfield tag="005">20140211064152.0</mx:controlfield><mx:controlfield tag="008">940916s1977    fr            00    fre d</mx:controlfield><mx:datafield ind1=" " ind2=" " tag="020"><mx:subfield code="a">2-266-00436-0 (Br) : Fr.fr. 5.30.</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="035"><mx:subfield code="a">(SNL)vtls000350495</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="035"><mx:subfield code="a">(Sz)000350495</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="040"><mx:subfield code="a">Sz</mx:subfield><mx:subfield code="c">SAZ</mx:subfield></mx:datafield><mx:datafield ind1="1" ind2=" " tag="100"><mx:subfield code="a">Simenon</mx:subfield><mx:subfield code="D">Georges</mx:subfield><mx:subfield code="9">140413197</mx:subfield><mx:subfield code="8">Simenon, Georges</mx:subfield><mx:subfield code="8">AT: Caraman, Georges</mx:subfield><mx:subfield code="8">AT: Dersonne, Jacques</mx:subfield><mx:subfield code="8">AT: Dorsage, Jean</mx:subfield><mx:subfield code="8">AT: Dossage, Jean</mx:subfield><mx:subfield code="8">AT: Dorsan, Luc</mx:subfield><mx:subfield code="8">AT: Du Perry, Jean</mx:subfield><mx:subfield code="8">AT: Georges, Martin-Georges</mx:subfield><mx:subfield code="8">AT: Isly, Georges d'</mx:subfield><mx:subfield code="8">AT: Martin-George, George</mx:subfield><mx:subfield code="8">AT: Martin-Georges, Georges</mx:subfield><mx:subfield code="8">AT: Pertuis, Maurice</mx:subfield><mx:subfield code="8">AT: Sandor, Jean</mx:subfield><mx:subfield code="8">AT: Sim, Georges</mx:subfield><mx:subfield code="8">AT: Vialis, Gaston</mx:subfield><mx:subfield code="8">AT: Viallis, Gaston</mx:subfield><mx:subfield code="8">AT: Brulls, Christian</mx:subfield><mx:subfield code="8">PS: Georges Caraman (pseud. de Georges Simenon)</mx:subfield><mx:subfield code="8">PS: Jacques Dersonne (pseud. de Georges Simenon)</mx:subfield><mx:subfield code="8">PS: Jean Dorsage (pseud. de Georges Simenon)</mx:subfield><mx:subfield code="8">PS: Luc Dorsan (pseud. de Georges Simenon)</mx:subfield><mx:subfield code="8">PS: Jean Dossage (pseud. de Georges Simenon)</mx:subfield><mx:subfield code="8">PS: Jean Du Perry (pseud. de Georges Simenon)</mx:subfield><mx:subfield code="8">PS: Martin-Georges Georges (pseud. de Georges Simenon)</mx:subfield><mx:subfield code="8">PS: Georges d'Isly (pseud. de Georges Simenon)</mx:subfield><mx:subfield code="8">PS: George Martin-George (pseud. de Georges Simenon)</mx:subfield><mx:subfield code="8">PS: Georges Martin-Georges (pseud. de Georges Simenon)</mx:subfield><mx:subfield code="8">PS: Maurice Pertuis (pseud. de Georges Simenon)</mx:subfield><mx:subfield code="8">PS: Jean Sandor (pseud. de Georges Simenon)</mx:subfield><mx:subfield code="8">PS: Georges Sim (pseud. de Georges Simenon)</mx:subfield><mx:subfield code="8">PS: Gaston Vialis (pseud. de Georges Simenon)</mx:subfield><mx:subfield code="8">PS: Gaston Viallis (pseud. de Georges Simenon)</mx:subfield><mx:subfield code="8">PS: Christian Brulls (pseud. de Georges Simenon)</mx:subfield></mx:datafield><mx:datafield ind1="1" ind2="2" tag="245"><mx:subfield code="a">L'ecluse No 1</mx:subfield><mx:subfield code="b">le commissaire Maigret</mx:subfield><mx:subfield code="c">Georges Simenon</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="260"><mx:subfield code="a">Paris</mx:subfield><mx:subfield code="b">Presses pocket</mx:subfield><mx:subfield code="c">1977</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="300"><mx:subfield code="a">185 p</mx:subfield><mx:subfield code="c">18 cm</mx:subfield></mx:datafield><mx:datafield ind1="1" ind2=" " tag="490"><mx:subfield code="a">Presses pocket</mx:subfield><mx:subfield code="v">1353</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="583"><mx:subfield code="8">1900304828</mx:subfield><mx:subfield code="a">dea</mx:subfield><mx:subfield code="i">ps</mx:subfield><mx:subfield code="c">NB064-2000</mx:subfield><mx:subfield code="l">nt</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="898"><mx:subfield code="a">BK040000000</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="949"><mx:subfield code="B">SNL</mx:subfield><mx:subfield code="E">vtls000350495</mx:subfield><mx:subfield code="b">10010</mx:subfield><mx:subfield code="j">NG 17247</mx:subfield><mx:subfield code="4">100</mx:subfield><mx:subfield code="p">1900304828</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="986"><mx:subfield code="a">SWISSBIB</mx:subfield><mx:subfield code="b">094491089</mx:subfield></mx:datafield></mx:record></srw:recordData></srw:record></ucp:updateRequest></soap:Body></soap:Envelope>