testrecords/update/REQ_094319723.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header/><soap:Body><ucp:updateRequest xmlns:srw="http://www.loc.gov/zing/srw/" xmlns:ucp="http://www.loc.gov/zing/srw/update/"><srw:version>1.0</srw:version><ucp:action>info:srw/action/1/replace</ucp:action><ucp:recordIdentifier>094319723</ucp:recordIdentifier><srw:record><srw:recordPacking>xml</srw:recordPacking><srw:recordSchema>info:srw/schema/1/marcxml-v1.1</srw:recordSchema><srw:recordData><mx:record xmlns:mx="http://www.loc.gov/MARC21/slim"><mx:leader>     cam a22      i 4500</mx:leader><mx:controlfield tag="001">094319723</mx:controlfield><mx:controlfield tag="003">Sz</mx:controlfield><mx:controlfield tag="005">20140211063822.0</mx:controlfield><mx:controlfield tag="008">990707s1994    sz a     c    000 0 eng d</mx:controlfield><mx:datafield ind1=" " ind2=" " tag="020"><mx:subfield code="a">3-907070-56-9 (geb) : CHF 35.-</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="035"><mx:subfield code="a">(SNL)vtls001218070</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="035"><mx:subfield code="a">(Sz)001218070</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="040"><mx:subfield code="a">Sz</mx:subfield><mx:subfield code="c">Sz</mx:subfield></mx:datafield><mx:datafield ind1="1" ind2=" " tag="041"><mx:subfield code="a">eng</mx:subfield><mx:subfield code="a">ger</mx:subfield><mx:subfield code="h">eng</mx:subfield></mx:datafield><mx:datafield ind1="2" ind2=" " tag="110"><mx:subfield code="a">Sammlung Eduard von der Heydt (Zürich)</mx:subfield><mx:subfield code="9">140323775</mx:subfield><mx:subfield code="8">Sammlung Eduard von der Heydt (Zürich)</mx:subfield><mx:subfield code="8">AT: Heydt, Sammlung</mx:subfield><mx:subfield code="8">AT: Von Der Heydt, Sammlung</mx:subfield><mx:subfield code="8">AT: VonDer Heydt, Sammlung</mx:subfield><mx:subfield code="8">AT: VonDerHeydt, Sammlung</mx:subfield><mx:subfield code="8">AT: Der Heydt, Sammlung</mx:subfield><mx:subfield code="8">AT: DerHeydt, Sammlung</mx:subfield><mx:subfield code="8">AT: Museum Rietberg Zürich. Sammlung Eduard von der Heydt</mx:subfield></mx:datafield><mx:datafield ind1="1" ind2="0" tag="245"><mx:subfield code="a">Indische Skulpturen der Sammlung Eduard von der Heydt</mx:subfield><mx:subfield code="b">Indian sculptures in the von der Heydt Collection</mx:subfield><mx:subfield code="c">beschreibender Katalog von J.E. van Lohuizen-de Leeuw ; [hrsg. vom] Museum Rietberg, Zurich</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="250"><mx:subfield code="a">2., unveränd. Aufl.</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="260"><mx:subfield code="a">Zürich</mx:subfield><mx:subfield code="b">Museum Rietberg</mx:subfield><mx:subfield code="c">1994</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="300"><mx:subfield code="a">250 S</mx:subfield><mx:subfield code="b">Ill</mx:subfield><mx:subfield code="c">23 x 23 cm</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="504"><mx:subfield code="a">Literaturverz</mx:subfield></mx:datafield><mx:datafield ind1="1" ind2="7" tag="600"><mx:subfield code="a">Heydt, Eduard von der</mx:subfield><mx:subfield code="d">1882-1964</mx:subfield><mx:subfield code="0">(DE-588)118704486</mx:subfield><mx:subfield code="2">gnd</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2="7" tag="648"><mx:subfield code="a">Geschichte</mx:subfield><mx:subfield code="2">gnd</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2="7" tag="650"><mx:subfield code="a">Plastik</mx:subfield><mx:subfield code="0">(DE-588)4046277-8</mx:subfield><mx:subfield code="2">gnd</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2="7" tag="650"><mx:subfield code="a">Sammlung</mx:subfield><mx:subfield code="0">(DE-588)4128844-0</mx:subfield><mx:subfield code="2">gnd</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2="7" tag="651"><mx:subfield code="a">Indien</mx:subfield><mx:subfield code="0">(DE-588)4026722-2</mx:subfield><mx:subfield code="2">gnd</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2="7" tag="655"><mx:subfield code="a">Katalog</mx:subfield><mx:subfield code="2">gnd</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2="9" tag="690"><mx:subfield code="a">Indien</mx:subfield><mx:subfield code="x">Plastik</mx:subfield><mx:subfield code="y">Geschichte</mx:subfield><mx:subfield code="x">Sammlung</mx:subfield><mx:subfield code="v">Katalog</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2="9" tag="690"><mx:subfield code="a">Heydt, Eduard von der</mx:subfield><mx:subfield code="x">Sammlung</mx:subfield><mx:subfield code="v">Katalog</mx:subfield></mx:datafield><mx:datafield ind1="1" ind2=" " tag="700"><mx:subfield code="a">Lohuizen-de Leeuw</mx:subfield><mx:subfield code="D">Joan E. van</mx:subfield><mx:subfield code="9">143809849</mx:subfield><mx:subfield code="8">Lohuizen-De Leeuw, Joan E van</mx:subfield><mx:subfield code="8">AT: Van Lohuizen-De Leeuw, Johanna Engelberta</mx:subfield><mx:subfield code="8">AT: De Leeuw, Joan E. Van Lohuizen</mx:subfield><mx:subfield code="8">AT: De Leeuw, Johannna E. Van Lohuizen</mx:subfield><mx:subfield code="8">AT: Van Lohuizen-De Leeuw, Joan E</mx:subfield></mx:datafield><mx:datafield ind1="2" ind2=" " tag="710"><mx:subfield code="a">Museum Rietberg Zürich</mx:subfield><mx:subfield code="9">140232788</mx:subfield><mx:subfield code="8">Museum Rietberg Zürich</mx:subfield><mx:subfield code="8">AT: Museum Rietberg Zürich. Park-Villa Rieter</mx:subfield><mx:subfield code="8">AT: Park-Villa Rieter Zürich</mx:subfield><mx:subfield code="8">AT: Rietbergmuseum Zürich</mx:subfield><mx:subfield code="8">AT: Rietberg, Museum</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="898"><mx:subfield code="a">BK040000000</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="949"><mx:subfield code="B">SNL</mx:subfield><mx:subfield code="E">vtls001218070</mx:subfield><mx:subfield code="b">10010</mx:subfield><mx:subfield code="j">N 240097</mx:subfield><mx:subfield code="4">100</mx:subfield><mx:subfield code="p">1901130589</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="986"><mx:subfield code="a">SWISSBIB</mx:subfield><mx:subfield code="b">00056267X</mx:subfield></mx:datafield></mx:record></srw:recordData></srw:record></ucp:updateRequest></soap:Body></soap:Envelope>